In [73]:
from pandas.compat import StringIO, BytesIO
import pandas as pd
with open ("/Users/ladanshamaei/Desktop/itcont.txt") as f:
    x=f.read()
df = pd.read_csv(StringIO(x))

In [74]:
df.head()

,id,prescriber_last_name,prescriber_first_name,drug_name,drug_cost
0,1000000001,Smith,James,AMBIEN,100
1,1000000002,Garcia,Maria,AMBIEN,200
2,1000000003,Johnson,James,CHLORPROMAZINE,1000
3,1000000004,Rodriguez,Maria,CHLORPROMAZINE,2000
4,1000000005,Smith,David,BENZTROPINE MESYLATE,1500

In [75]:
df1=df.groupby(['drug_name'])['drug_cost'].sum().reset_index()

In [76]:
df1

              drug_name  drug_cost
0                AMBIEN       3000
1  BENZTROPINE MESYLATE       1500
2        CHLORPROMAZINE       3000

In [77]:
df2=df.groupby(['drug_name'])['id'].count().reset_index()
df2

              drug_name  id
0                AMBIEN   4
1  BENZTROPINE MESYLATE   1
2        CHLORPROMAZINE   2

In [78]:
df0=pd.merge(df2,df1,on="drug_name")

In [79]:
df0=df0.rename(columns={'id':'num_prescriber','drug_cost':'total_cost'})
df0=df0.sort_values("total_cost",ascending=False)
df0

              drug_name  num_prescriber  total_cost
0                AMBIEN               4        3000
2        CHLORPROMAZINE               2        3000
1  BENZTROPINE MESYLATE               1        1500

In [80]:
df0.to_csv('/Users/ladanshamaei/Desktop/top_cost_drug.txt',sep=",",header=True,index=False)